{
    "description": "Terminology that is used when working with Personas.",
    "terms": [
        {
            "term": "persona",
            "definitions": [
                "A research-based, fictional representation of your target audience or users that embodies their characteristics, behaviors, goals, and pain points."
            ]
        },
        {
            "term": "buyer persona",
            "definitions": [
                "A persona that focuses on the commercial decision-making traits that can aid marketing and sales activities by emphasizing purchasing decisions and buying behaviors. The focus on this type of persona is more on market research and synthesizing knowledge about existing customer or developers. The buyer at a smaller company may be an individual contributing engineer or at an enterprise may be reserved for a purchasing or accounts payable team."
            ]
        },
        {
            "term": "user persona",
            "definitions": [
                "A persona that focuses on usability and user-centered design traits that can aid product and user-experience decisions. The focus is put on usage patterns, technical requirements, and experience goals."
            ]
        },
        {
            "term": "developer persona",
            "definitions": [
                "A persona that focuses on the characteristics, behaviors, and needs of software developers, often used in product development and marketing to tailor solutions to their specific requirements."
            ]
        },
        {
            "term": "demographics",
            "definitions": [
                "Statistical data relating to the population overall that a particular persona belongs. Includes attributes such as age, gender, income level, education, occupation, or geographic location."
            ]
        },
        {
            "term": "psychographics",
            "definitions": [
                "Qualitative data that describes the personality, values, interests, attitudes, and lifestyles of a persona. This helps to understand the motivations and preferences that drive behaviors."
            ]
        },
        {
            "term": "firmographics",
            "definitions": [
                "Attributes that describe the workplace characteristics of the organization or company for a persona. Includes attributes such as industry, company size, revenue, location, and organizational structure. This is often used to understand the business environment of a persona."
            ]  
        },
        {
            "term": "customer persona",
            "definitions": [
                "A representation of an existing customer who has already purchased your product or service, highlighting their ongoing needs, satisfaction factors, and loyalty drivers. This may be a specific instance of a persona to acknowledge an exsiting relationship."
            ]
        },
        {
            "term": "quantitative persona",
            "definitions": [
                "A persona created primarily from numerical data, statistics, and analytics rather than qualitative interviews or observations, often using segmentation from large data sets."
            ]
        },
        {
            "term": "jobs to be done",
            "definitions": [
                "A framework that focuses on understanding the specific task a developer is trying to accomplish (the 'job') rather than customer attributes. This approach often used by product and user experience teams helps to identify the real reasons people use products or services rather than behavioral personas in general."
            ]
        },
        {
            "term": "segmentation",
            "definitions": [
                "The division of a market or audience into discrete groups that share some common characteristics, behaviors, or needs, which can then be used as a basis for persona development. Can work well with quantitative means of sizing each segment for prioritization."
            ]
        },
        {
            "term": "maturity model",
            "definitions": [
                "An approach to describing the evolution of capabilities, processes, and organizational behaviors to evaluate the development or sophistication of a role or organization. There may be a scoring system that can be used to assess where on the maturity progression one sits to judge the appropriateness of a solution or product fit."
            ]
        },
        {
            "term": "trait",
            "definitions": [
                "A distinguishing quality or characteristic that defines an aspect of a persona, such as technical skill level, job role, or communication preferences."
            ]
        },
        {
            "term": "Persona Library System",
            "definitions": [
                "A structured framework and approach to gathering personas that can help an organization or community to make decisions."
            ]
        },
        {
            "term": "PLS",
            "definitions": [
                "Acronym for the DEVREL Persona Library System"
            ],
            "see": "Persona Library System"
        },
        {
            "term": "JTBD",
            "definitions": [
                "Acronym sometimes used for jobs to be done"
            ],
            "see": "jobs to be done"
        },
        {
            "term": "CTA",
            "definitions": [
                "Acronym used for call to action."
            ]
        },
        {
            "term": "assumptive persona", 
            "definitions": [
                "A persona that is created based on assumptions or generalizations rather than direct research or data, often used as a placeholder until more accurate personas can be developed. This type of persona may be based on stereotypes or common industry practices and should be validated with real user data. Lean UX methodologies often use this type of ad-hoc persona to get started with product development without deeper research."
            ]
        },
        {
            "term": "proto-persona",
            "see": "assumptive persona"
        },
        {
            "term": "user story",
            "definitions": [
                "A concise description of a feature told from the perspective of a persona, typically following the format: 'As a [persona], I want [goal or job to be done] so that [reason].'"
            ]
        },
        {
            "term": "ideal customer profile",
            "definitions": [
                "A detailed description of a company or organization that would derive the most value from your product or service, become a long-term customer, and potentially advocate for your brand. Unlike personas which focus on individuals, ICPs typically describe the organizational characteristics such as industry, company size, revenue, geography, number of engineers, presence of a department, partner technology choices (such as cloud IaaS), and business challenges."
            ]
        }
    ]
}