{
    "description": "A collection of talks and video courses that feature creating and using personas prominently in their subject matter.",
    "data": [
        {
            "type": "video",
            "title": "UX Design: Creating Personas",
            "authors": ["Nodder, Chris"],
            "publish-date": "2016-01-01",
            "publication": "LinkedIn Learning",
            "url": "https://www.linkedin.com/learning/ux-design-3-creating-personas",
            "description": "Who are you developing for? How will they use your design? Building user personas can answer these important questions. In this course, Chris Nodder shows you how to create personas using information about the users most relevant to your business. He shows you how to gather and use data from interactions and site visits to define groups that represent a picture of your user types. These personas can help drive development and make sure your team is designing your product, application, or website with the same customer in mind, resulting in coherent, focused goals and an optimal user experience."
        },
        {
            "type": "video",
            "title": "Personas: you're doing it wrong",
            "authors": ["Hunsaker, Claire"],
            "publish-date": "2019-01-01",
            "publication": "DevRelCon",
            "url": "https://youtu.be/Tn_69hjAktM",
            "description": "Creating personas to help group and understand the audience is a routine part of marketing. However, it's still not a common part of developer relations practice. In this talk from DevRelCon San Francisco 2019, Okta's Senior Director of Demand Generation and Developer Marketing, Claire Hunsaker, looks at how to apply personas to developer audiences."
        },
        {
            "type": "video",
            "title": "Embracing the hobbyist persona",
            "authors": ["Gangwani, Tarun"],
            "publish-date": "2019-01-01",
            "publication": "DevRelCon",
            "url": "https://youtu.be/2euRRei9Ajk",
            "description": "As Product Manager for Twitch Developer Experience, Tarun Gangwani helps developers build sustainable businesses on the streaming platform. In this talk from DevRelCon San Francisco 2019, Tarun runs through the reasoning and practicalities of embracing the hobbyists in your developer community."
        },
        {
            "type": "video",
            "title": "Segmenting Developers into personas",
            "authors": ["SlashData"],
            "publish-date": "2020-01-01",
            "publication": "SlashData",
            "url": "https://youtu.be/liTCvhUCiIM",
            "description": "Developers come in all shapes and sizes. Whether you group them by the technologies they use, their coding background, their professional status, their demographics or their motivations, the conclusion is the same. The developer population is not a single homogeneous mass that may be expected to behave in a coherent way..."
        },
        {
            "type": "video",
            "title": "Customer Experience: Creating Customer Personas",
            "authors": ["Golden, Myra"],
            "publish-date": "2022-01-01",
            "publication": "LinkedIn Learning",
            "url": "https://www.linkedin.com/learning/customer-experience-creating-customer-personas",
            "description": "In today's competitive marketplace, knowing your customer is almost as important as knowing your own products and services. With limited marketing budgets and competition for consumer's attention, you need to optimize your message to target people who are most likely to drive sales. In this course, Myra Golden shows you how to create customer personas that will allow you to better connect with your customers and improve engagement. She shares important tips like how to conduct research, how to identify your customers' motivation and pain points, and ways to apply persona data for engagement, support, and problem resolution. By following her step-by-step guide—along with a cheat sheet of persona templates—you'll have the tools to create your own customer personas to help you increase sales."
        }
    ]
}
